/**
 ******************************************************************************
 * 文件:bsp_usocket.c
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1         2014-12-01     zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/

//----------------------------------------------------------------------------
// 文件条件编译
//----------------------------------------------------------------------------
#if (1)

//----------------------------------------------------------------------------
//includes
//----------------------------------------------------------------------------
#include "ntp_usocket.h"

//----------------------------------------------------------------------------
//define s
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
//global vari
//----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	 :	void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//----------------------------------------------------------------------------- 
USockptr usocket_create(Netcardptr pNetcard, USocketMode md, mlu16 txsize, mlu16 rxsize)
{
	mls8 sn;
    USockptr pusck;

	//在网上创建socket
	sn=pNetcard->usocket_sn_generate();
	while (sn<0)
	{
		;
	}

    //分配套接字内存
    pusck = mlos_malloc (e_mem_sram, sizeof(USocket));
    pusck->sn = sn;
    pusck->mode = md;
    pusck->sta = e_sck_sta_opening;//e_sck_sta_closed;
    pusck->connSta = e_sck_cnn_none;
    pusck->rxsta = e_sck_rxNull;
    pusck->timeOut = 0;
    pusck->txsta = e_sck_txFinished;
    pusck->txDataLen = 0;
    pusck->rxDataLen = 0;
    pusck->pMynetcard = pNetcard;			//socket的网卡

    //分配缓冲区
    pusck->txSize = txsize;
    pusck->rxSize = rxsize;
    //基于net uart 的socket
    pusck->pTxBuf = mlos_malloc (e_mem_sram, txsize);
    pusck->pRxBuf = mlos_malloc (e_mem_sram, rxsize);

    //创建收发定时器
    pusck->pTxtimer = ltimer_create ();
    pusck->pRxtimer = ltimer_create ();
    ltimer_load (pusck->pTxtimer, 10);
    ltimer_stop (pusck->pTxtimer);

    //创建驱动任务
    pusck->pMyDriveTask = subtask_create (ltimer_create ());

    return pusck;

}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数	 :	void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//----------------------------------------------------------------------------- 
void usocket_reset(USockptr pusck)
{
    if(pusck==nullptr)
        return ;

        pusck->txDataLen = 0;
        pusck->rxDataLen = 0;
        pusck->sta = e_sck_sta_closed;
        subtask_reset(pusck->pMyDriveTask);
}

//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------
#endif

