/**
 ******************************************************************************
 * 文件:ntp_msg_idn.h
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *		net消息id，资源声明
 *
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----日期   ---作者    ----------   说明-------------------------------------
 * v0.1     2014-12-01   zzx           创建该文件
 *
 *
 *
 ******************************************************************************
 **/

#ifndef  _NTP_UPPER_MSG_IDN_H__
#define  _NTP_UPPER_MSG_IDN_H__

//----------------------------------------------------------------------------
//includes
//----------------------------------------------------------------------------

#if 1

//----------------------------------------------------------------------------
// upper 消息 id
//----------------------------------------------------------------------------
typedef enum
{

    UPPER_MSG_NULL = 0,

    UPPER_MSG_connect = 'A', //联机命令
    UPPER_MSG_sample = 'B', //主通道采样数据
    UPPER_MSG_disconnect = 'C', //广播脱机/解除脱机命令
    UPPER_MSG_start = 'D', //启动/跳转命令
    UPPER_MSG_stop = 'E', //暂停/停止命令
    UPPER_MSG_conitnue = 'F', //发送续接信息
    UPPER_MSG_brdcstSop = 'G', //发送广播停止命令
    UPPER_MSG_stepInfo = 'H', //下发工步信息命令
    UPPER_MSG_chnlStack = 'I', //循环堆栈信息
    UPPER_MSG_calibrate = 'J', //通道修调/复检/计量命令
    UPPER_MSG_caliCode = 'K', //码表更新命令
    UPPER_MSG_setLed = 'L', //LED灯状态控制
    UPPER_MSG_clearLed = 'M', //LED灯广播清除
    UPPER_MSG_ctrlAlarm = 'N', //报警灯状态控制
    UPPER_MSG_parallel = 'O', //通道并联/解并命令

} UpperNtpMsgIDN;

//----------------------------------------------------------------------------
// end of file
//----------------------------------------------------------------------------
#endif
#endif

