/**
 ******************************************************************************
 * 文件:    
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:  
 *          
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1                       2014-12-01          zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/

//----------------------------------------------------------------------------
//includes
//----------------------------------------------------------------------------
#include "u_app.h"
#include "u_led.h"
#include "ntp.h"
#include "ctp.h"
#include "utp.h"
#include "upper_ntp.h"
#include "tool.h"
#include "mx35.h"
#include "cs_sdcard.h"
#include "u_setting.h"
#include "iap.h"
#include "mcu_flash.h"
#include "ds.h"

#include "tray_bl.h"
#include "cmb_bl.h"

//----------------------------------------------------------------------------
//   define 
//---------------------------------------------------------------------------- 

//----------------------------------------------------------------------------
//global varibale 
//----------------------------------------------------------------------------

//系统应用定义
Applications app;

//---------------------------------------------------------------------------
// 名    称：
//---------------------------------------------------------------------------
//功    能：无描述
//
//入口参数：无
//
//出口参数：无
//
//修改记录：
// 1. by zzx  2015-07-29		 编写函数
//---------------------------------------------------------------------------
void app_init(void)
{
	__disable_irq();
	
	mcu_flash_init();
	
	setting_init();			//初始化配置文件
	
	//can 传输协议初始化
	ctp_init(CAN_BCAST_ADDR, _500KBps_, CAN_BCAST_ADDR, _500KBps_);

	//网络传输协议初始化
	ntp_init(mySetting->myip,mySetting->netmask,mySetting->gateway,mySetting->mac);
	
	upper_ntp_init (mySetting->remoteip, mySetting->remotePort,mySetting->myPort);			//与上位机的协议实例初始化

	iap_init();								//在线升级

    led_init (1000);

	ds_init();							//数据存储
	
	//中位机不同的业务应用，初始化，
	tbl_init();						//托盘应用业务逻辑
	cbl_init();						//并机应用业务初始化

	tool_init ();							//与调试工具协议的初始化

	__enable_irq();


}

//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------

