/**
 ******************************************************************************
 * 文件:ds_config.h
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1      2014-12-01          zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/


#ifndef _DS_CONFIG_H_
#define _DS_CONFIG_H_

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------


//---------------------------------------------------------
//文件条件编译
//---------------------------------------------------------

#if  1

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------

//#include "mlos_dtd.h"

//---------------------------------------------------------
//数据存功能模块配置
//---------------------------------------------------------

#define DS_EN 				(1)

#define DS_FLASH_PAGE_SIZE 		(512)		//数据存储flash的页大小

//---------------------------------------------------------
//日志数据存储配置
//---------------------------------------------------------

#define DS_LOG_EN 									(1)

#define DS_LOG_FILE_VERSION 						(2)  			//日志的版本

//规划flash page0-1，用来存储，文件头
#define DS_LOG_FILE_BASE_PAGE 						(1)				


//日志最大64M,配置使用32M
#define DS_LOG_PAGE_MAX 							(131072) 			//日志使用flash的最大页数
#define DS_LOG_PAGE_OUNT							(65536)			//日志使用flash量，

//日志按行存储，一行数据的大小固定	
#define DS_LOG_LINE_BYTES 							(128)  			//一行日志行大小128byte

//行每页，一页flash存储几行数据，注意行均分页，
#define DS_LOG_LINE_PER_PAGE 						(DS_FLASH_PAGE_SIZE/DS_LOG_LINE_BYTES)//一页有多少行

#define DS_LOG_LINE_MAX 							(DS_LOG_LINE_PER_PAGE*DS_LOG_PAGE_OUNT) //最大行数





//---------------------------------------------------------
//托盘数据存储配置
//---------------------------------------------------------

#define DS_TRAY_EN 			(1)

#define DS_TRAY_FILE_VERSION 								(1)  			//托盘数据的版本


//托盘的数量  
#define DS_TRAY_MAX 										(4)

//托盘数据文件头存储的起始页，
#define DS_TRAY_FILE_BASE_PAGE 								(131073)				
	

//一行数据的大小，注意配置一行大小为整数页，
#define DS_TRAY_LINE_BYTES 							(1440)

//页每行，即一行数据占据flash多少页
#define DS_TRAY_PAGE_PER_LINE 						(3)					//3页
 

//托盘数据文件的大小，即存储多少行数据，脱机缓存30分钟数据，1s一条，即1800
#define DS_TRAY_LINE_MAX 							(1800) //最大行数

//文件大小，页数
#define DS_TRAY_PAGE_COUNT 					(DS_TRAY_PAGE_PER_LINE*DS_TRAY_LINE_MAX)			//+2,2page 文件头AB


//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------
#endif 				//文件条件编译结束
#endif 






