/**
 ******************************************************************************
 * 文件:mlos_malloc.c
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *
 ******************************************************************************
 *                      文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1                       2014-12-01          zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/

//----------------------------------------------------------------------------
//includes
//----------------------------------------------------------------------------
#include <stdio.h>
#include <stdlib.h>
#include "mlos.h"
#include "mlos_list.h"
#include "mlos_port.h"//该头文件，需要根据移植到不同的mcu平台，用户去实现提供系统调用的接口
#include "mlos_dtd.h"


//----------------------------------------------------------------------------
//内存资源声明
//----------------------------------------------------------------------------

// 内存块链表
_private List memBlockList;



//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
ListPtr mlos_mem_list(void)
{

    return &memBlockList;
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void mlos_mem_statistics(void)
{

    MemBlockPtr pMemBlock;
    mlos.memSize=0;//内存总大小
    mlos.usedMemSize=0;//已使用的内存大小
    pMemBlock=memBlockList.head;
    while (nullptr!=pMemBlock)
    {
        mlos.memSize+=pMemBlock->size;//内存总大小
        mlos.usedMemSize+=pMemBlock->nextFreebyte;//已使用的内存大小
        pMemBlock=pMemBlock->pnext;
    }
        
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void* mlos_malloc(MemoryType mt,mlu32 size)
{
    mlu32 alignment;
    void * pFreeMem;
    MemBlockPtr pMemBlock;
    
    //字节对齐,取内存
    alignment= (size & BYTE_ALIGNMENT_MASK);
    if( alignment != 0 )
    {
        size += ( ARCH_BYTE_ALIGNMENT - alignment );
    }

    pFreeMem=nullptr;
    
    //选择ram
    pMemBlock=memBlockList.head;
    while (nullptr!=pMemBlock)
    {
        //内存块类型
        if(mt==pMemBlock->type)
        {
            //内存空间判断
            if((pMemBlock->nextFreebyte+size)<pMemBlock->size)
            {
                //计算偏移
                pFreeMem=pMemBlock->mem+pMemBlock->nextFreebyte;
                pMemBlock->nextFreebyte+=size;
                break;
            }
        }
        pMemBlock=pMemBlock->pnext;
    }
    
    //内存不够，设置断点
    while (nullptr==pFreeMem)
    {
        //
        alignment=pMemBlock->nextFreebyte+size-pMemBlock->size;
    }

    //统计内存使用情况
    mlos_mem_statistics();

    //初始化内存块
    memset(pFreeMem,0,size);
    
    return pFreeMem;
    
}




//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
mlu8  mlos_mem_mount(MemBlockPtr mb)
{

    //参数检查
    if(nullptr==mb||nullptr==mb->mem||0==mb->size)
    {
        return 1;
    }

    //
    mb->nextFreebyte=0;
    mb->pnext=nullptr;

    list_append(&memBlockList,mb);

    //mem chek
    //mlos_mem_check();
    //计算 内存总大小 byte
    
    return 0;
    
}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void mlos_mem_init(void)
{

    //单向链表管理内存块
    list_init(&memBlockList, e_lst_sortUnordered, e_lst_linkSingly);

    //根据不同的mcu，分配ram，挂载到系统
    port_mem_init();
    
}

//----------------------------------------------------------------------------
//                          end  of file
//----------------------------------------------------------------------------




