/**
 ******************************************************************************
 * 文件:ds_log.c
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1      2014-12-01          zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------
#include "ds_config.h"

//---------------------------------------------------------
//文件条件编译
//---------------------------------------------------------

#if  (DS_LOG_EN && DS_EN)

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------
#include "mlos.h"
#include "ds_log.h"
#include "cs_sdcard.h"
#include "mlos_log.h"
#include<string.h>

//---------------------------------------------------------
//define
//---------------------------------------------------------

#define LOG_CACHE_PAGE_MAX 			(4)			//缓存4页


//----------------------------------------------------------------------------
//page
//----------------------------------------------------------------------------
typedef struct{

	
	mlu8 buf[DS_LOG_LINE_PER_PAGE][DS_LOG_LINE_BYTES];

}LogCachePage,*LogCachePageptr;

//----------------------------------------------------------------------------
//global variable
//----------------------------------------------------------------------------

DSFilePtr logfile=nullptr;			//日志文件

//日志缓
Queptr pLogQue=nullptr;

//缓存4page
LogCachePage logCachePages[LOG_CACHE_PAGE_MAX];

//当前缓存页写入，行偏移
mlu8 curCachePageLineOffset=0;

//读写操作页缓存




//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :   void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void ds_log_cache_write(mlu8* logbuf,mlu16 len)
{

	if(len==0)						//无数据写入，直接返回
	{
		return;
	}
	
	if(pLogQue->isfull)				//缓存队列已满，直接返回
	{
		MLOS_BKPT(mltrue);
		return;
	}

	LogCachePageptr  page=(LogCachePageptr)pLogQue->tail->pdata;	//取队列尾，缓存页，写入日志

	if(len>DS_LOG_LINE_BYTES)
	{
		len=DS_LOG_LINE_BYTES;										//日志行写入最大长度限制
	}
	memcpy(&page->buf[curCachePageLineOffset][0],logbuf,len);		//日志写入缓存
	curCachePageLineOffset++;										//行号偏移，直到页写满，
	if(curCachePageLineOffset>=DS_LOG_LINE_PER_PAGE)	
	{
		curCachePageLineOffset=0;									//下一页从0行开始写
		que_en(pLogQue);											//写满一页，入列
	}

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void ds_log_subtask(void)
{

	LogCachePageptr page=(LogCachePageptr)que_take(pLogQue);					//取队列数据

	if (page==nullptr)
	{
		return;					//无日志要存储，直接返回
	}

	if(mlfalse==dsf_write_page(logfile,(mlu8*)page))
	{
		MLOS_BKPT(mlfalse);
		return ;				//写入失败
	}

	que_de(pLogQue);						//数据出列

	
}


//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void ds_log_init(void)
{

	//缓存队列
	pLogQue=que_create(e_mem_sram, LOG_CACHE_PAGE_MAX, DS_FLASH_PAGE_SIZE, (mlu8*)logCachePages);
	
	
	logfile=mlos_malloc(e_mem_sram, sizeof(DSFile));												//给文件分配内存
	logfile->bOpened=mlfalse;								
	logfile->basePage=DS_LOG_FILE_BASE_PAGE;														//初始化文件头基地址
	logfile->endPage=DS_LOG_FILE_BASE_PAGE+DS_LOG_PAGE_OUNT+DS_FILE_BACKUP_PAGE_NUM;				//文件结束地址
	logfile->pagesPerLine=0;
	logfile->linesPerPage=DS_LOG_LINE_PER_PAGE;
	logfile->linePageIndx=0;
	logfile->lineMax=DS_LOG_LINE_MAX;
	
	dsf_open(logfile,DS_LOG_FILE_VERSION);			//打开创建日志文件

	
	//设置日志存盘接口
	log_save_disk_port_set(ds_log_cache_write);
	
}


//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------
#endif 







