/**
 ******************************************************************************
 * 文件:    ctp_dtd.h
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:    
 * 内容简介:     dtd-data type define 数据类型定义
 *                   
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1                                                                            创建该文件
 *
 *
 *
 ******************************************************************************
 **/
#ifndef  _CTP_DATA_TYPE_DEFINE_H__
#define _CTP_DATA_TYPE_DEFINE_H__

//----------------------------------------------------------------------------
//define
//----------------------------------------------------------------------------
#include"mlos_dtd.h"
#include"ctp_default_config.h"


//----------------------------------------------------------------------------
//	define
//----------------------------------------------------------------------------

// PF 域
#define CAN_PF_SINGLE      			0 		//PF=0，标识单帧
#define CAN_PF_MULTI        		1 		//PF=1，标识多帧

//ADDR 域
#define CAN_ADDR_BRDCST				63	//ADDR=63,广播地址


//can帧数据长度
#define CAN_SF_DAT_LEN 			8
#define CAN_MF_DAT_LEN 			10


//标准、扩展帧定义
#define CAN_STID   				0
#define CAN_EXID  				1

//数据帧、远程帧
#define CAN_DATA_FRAME   		0
#define CAN_REMOTE_FRAME  		1


//----------------------------------------------------------------------------
// can card id 枚举 配置
//----------------------------------------------------------------------------
 typedef enum {

	CAN_CARD_1=0,
	CAN_CARD_2,
	
}CANCardID;

//----------------------------------------------------------------------------
//波特率
//----------------------------------------------------------------------------
typedef enum {

	_1MBps_=1,
	_500KBps_,
	_250KBps_,
	_125KBps_,
	_100KBps_,
	_50KBps_,
	_20KBps_,
	_10KBps_
	
}CANBaudRate;

//----------------------------------------------------------------------------
// can tp 站
//----------------------------------------------------------------------------
 typedef enum {

	CTP_MASTER_STATION,
	CTP_SLAVER_STATION,
	
}CANtpStation;
	
//----------------------------------------------------------------------------
//多帧收发状态
//----------------------------------------------------------------------------
typedef enum {

	CAN_MFRX_FREE =0,				//多帧空闲
	CAN_MFRX_ING,  				//多帧接收中	
	CAN_MFRX_COMPLETED,   		//多帧接收完成

} CtpMultiFrameRxStatus;
	
//----------------------------------------------------------------------------
//  CAN 多帧接收管理单元
//----------------------------------------------------------------------------
typedef struct{


	mlvu8 sta;			//多帧报文的收发状态
	mlu8 ccid;			//can card id
	mlu8 nextFrame;		//多帧报文的，next frame sequence	
	mlu8  addr; 		//报文源地址

	mlu8 idn;			//消息的id
	mlu8 frmTotal;		//需要接收的总帧数
	mlu16 bufSize;
	mlu8 *buffer;			//多帧缓存
	mlu8* offsetptr;		//用于接收，指向buffer的偏移地址
	
}CtpMultiFrameMsg,*CtpMfMsgptr;


//----------------------------------------------------------------------------
// ctp 流水号 
//----------------------------------------------------------------------------

typedef unsigned char 	CtpSerialNumber; 

#endif

//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------

