/**
 ******************************************************************************
 * 文件:mx35_spi_diver.c
 * 作者:   zzx
 * 版本:   V0.01
 * 日期:     2014-12-01
 * 内容简介:
 *
 ******************************************************************************
 *  					文件历史
 *
 * 版本号-----  日期   -----   作者    ------   说明
 * v0.1      2014-12-01          zzx                 创建该文件
 *
 *
 *
 ******************************************************************************
 **/

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------
//#include "mlf_config.h"

//---------------------------------------------------------
//文件条件编译
//---------------------------------------------------------

#if  1

//---------------------------------------------------------
//inclludes
//---------------------------------------------------------

#include"common_data.h"
#include "r_qspi.h"
#include "hal_data.h"

#include "mx35_spi_driver.h"



//---------------------------------------------------------
//define
//---------------------------------------------------------



//----------------------------------------------------------------------------
//extern variable
//----------------------------------------------------------------------------


//----------------------------------------------------------------------------
//global variable
//----------------------------------------------------------------------------

R_QSPI_Type* pQspi=R_QSPI;

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
mlu8 mx_spi_flash_read(MxSpi *pmxspi, mlu8 rCmd, mlu32 addr, mlu32 byteCount, mlu8 *rBuf)
{
	mlu8 SFMAS;
	mlu32 i;

	pQspi->SFMSMD_b.SFMRM=pmxspi->mode;								//spi 模式
	SFMAS=pmxspi->addrLen+pmxspi->dummyLen;
	if(SFMAS>0)
	{
		pQspi->SFMSAC_b.SFMAS=SFMAS-1;							//地址的长度
	}
	else
	{
		pQspi->SFMSAC_b.SFMAS=2;
	}
	
	
	pQspi->SFMCMD = 1;
	pQspi->SFMCOM=rCmd;												//cmd
	for (i = 1; i <= pmxspi->addrLen; ++i)							//addr
	{
		pQspi->SFMCOM=(addr>>((pmxspi->addrLen-i)*8));	
	}
	for (i = 0; i < pmxspi->dummyLen; ++i)							//dummy
	{
		pQspi->SFMCOM=0;
	}

	mlu32 index = 0;
	while (index < byteCount)
	{
		//pQspi->SFMCOM =0x0 ;
		rBuf[index]=pQspi->SFMCOM;
		index++;
	}

	pQspi->SFMCMD = 1;
	pQspi->SFMCMD = 0;
	return 0;
	
}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
mlu8 mx_spi_flash_write(MxSpi *pmxspi, mlu8 wCmd, mlu32 addr, mlu32 byteCount, mlu8 *wBuf)
{
	mlu8 SFMAS;
	mlu32 i;

	pQspi->SFMSMD_b.SFMRM=pmxspi->mode;								//spi 模式
	SFMAS=pmxspi->addrLen+pmxspi->dummyLen;
	if(SFMAS>0)
	{
		pQspi->SFMSAC_b.SFMAS=SFMAS-1;							//地址的长度
	}
	else
	{
		pQspi->SFMSAC_b.SFMAS=2;
	}

	
	
	pQspi->SFMCMD = 1;
	pQspi->SFMCOM=wCmd;												//cmd
	for (i = 1; i <= pmxspi->addrLen; ++i)							//addr
	{
		pQspi->SFMCOM=(addr>>((pmxspi->addrLen-i)*8));	
	}
	for (i = 0; i < pmxspi->dummyLen; ++i)							//dummy
	{
		pQspi->SFMCOM=0xaa;
	}

	mlu32 index = 0;
	while (index < byteCount)
	{
		pQspi->SFMCOM=wBuf[index++];
	}

	pQspi->SFMCMD = 1;
	pQspi->SFMCMD = 0;
	return 0;

}

//-----------------------------------------------------------------------------
// 函数名：
//-----------------------------------------------------------------------------
//
// 返回值 : void
// 参数   :  void
//
//
//
//功能描述：
//
//
//修改履历：
//1.zzx ：  2014-12-01  ：创建函数
//
//-----------------------------------------------------------------------------
void mx_spi_init(void)
{

	R_QSPI_Open(&g_qspi0_ctrl, &g_qspi0_cfg);
	
}


//----------------------------------------------------------------------------
//							end  of file
//----------------------------------------------------------------------------
#endif 






